dataset_gen/CE_datasets/FPO_External/Regular/Design_Point_0/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16384
(
(0.00390625 0.00390625 0.05)
(0.0117188 0.00390625 0.05)
(0.0195312 0.00390625 0.05)
(0.0273438 0.00390625 0.05)
(0.0351563 0.00390625 0.05)
(0.0429688 0.00390625 0.05)
(0.0507812 0.00390625 0.05)
(0.0585938 0.00390625 0.05)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0 0.00390625 0.05)
(0 0.0117187 0.05)
(0 0.0195312 0.05)
(0 0.0273437 0.05)
(0 0.0351562 0.05)
(0 0.0429688 0.05)
(0 0.0507812 0.05)
(0 0.0585938 0.05)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(1 0.00390625 0.05)
(1 0.0117187 0.05)
(1 0.0195312 0.05)
(1 0.0273437 0.05)
(1 0.0351562 0.05)
(1 0.0429688 0.05)
(1 0.0507812 0.05)
(1 0.0585938 0.05)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.00390625 0 0.05)
(0.0117187 0 0.05)
(0.0195312 0 0.05)
(0.0273437 0 0.05)
(0.0351562 0 0.05)
(0.0429688 0 0.05)
(0.0507812 0 0.05)
(0.0585938 0 0.05)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.00390625 1 0.05)
(0.0117187 1 0.05)
(0.0195312 1 0.05)
(0.0273437 1 0.05)
(0.0351562 1 0.05)
(0.0429688 1 0.05)
(0.0507812 1 0.05)
(0.0585938 1 0.05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
