dataset_gen/CE_datasets/FPO_External/Regular/Design_Point_0/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16384
(
0.00390625
0.0117188
0.0195312
0.0273438
0.0351563
0.0429688
0.0507812
0.0585938
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform 0;
    }
    right
    {
        type            calculated;
        value           uniform 1;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.00390625
0.0117187
0.0195312
0.0273437
0.0351562
0.0429688
0.0507812
0.0585938
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.00390625
0.0117187
0.0195312
0.0273437
0.0351562
0.0429688
0.0507812
0.0585938
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
