dataset_gen/CE_datasets/FPO_External/Regular/Design_Point_0/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;  // For example, 101325 Pa (1 atm)

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            fixedValue;
        value           uniform 101325;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

