dataset_gen/CE_datasets/FPO_External/Regular/Design_Point_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          128;
        startFace       32512;
    }
    right
    {
        type            patch;
        nFaces          128;
        startFace       32640;
    }
    bottom
    {
        type            patch;
        nFaces          128;
        startFace       32768;
    }
    top
    {
        type            patch;
        nFaces          128;
        startFace       32896;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          32768;
        startFace       33024;
    }
)

// ************************************************************************* //
